Обучение/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.СчетНаОплатуПокупателю</basedOn>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРеализацияТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Обучение/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Обучение/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокументаУправляемаяУслуги/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначениеПараметровФО();	
	
	Если Параметры.Свойство("ИзменитьВидОперации") Тогда
		Объект.ВидОперации = Параметры.ИзменитьВидОперации;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПараметровФО()

	ПараметрыФО = Новый Структура;
	ПараметрыФО.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыФО.Вставить("Организация", Объект.Организация);
	ПараметрыФО.Вставить("Период", Объект.Дата);
	
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);

КонецПроцедуры // ()

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьЗначениеПараметровФО();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьЗначениеПараметровФО();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УстановитьЗначениеПараметровФО();
	
КонецПроцедуры

//&НаКлиенте
//Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	Отбор = Новый Структура;
//	Отбор.Вставить("ВидНоменклатуры",  ПодготовитьМассивВидовНоменклатуры());
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Отбор", Отбор);
//	
//	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы,  Элемент);
//	
//КонецПроцедуры

&НаСервере
Функция ПодготовитьМассивВидовНоменклатуры()

	МассивВидовНоменклатуры = Новый Массив;
	МассивВидовНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Товар);
	МассивВидовНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Материал);
	
	Если ПолучитьФункциональнуюОпциюФормы("ВыпускПродукции") Тогда
		
		МассивВидовНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Продукция);		
	
	КонецЕсли;	
	
	Возврат МассивВидовНоменклатуры;

КонецФункции // ()

&НаКлиенте
Процедура ДобавитьРеализацию(Команда)
	
	ДанныеЗаполнения = Новый Структура("Организация, Контрагент, Договор, Менеджер, Склад");
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Объект);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТовары(Команда)
	
	Если Объект.Товары.Количество()>0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьТоварыЗавершение", ЭтотОбъект), "Подтвердите очистку табличной части ""Товары"". Очистить?",РежимДиалогаВопрос.ДаНет);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТоварыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Объект.Товары.Очистить();
		ПоказатьПредупреждение(Неопределено, "Очистка успешно завершена!");			
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Склад) и Не ПараметрыЗаписи.Свойство("НеПроверятьСклад") Тогда
	
		ОсновнойСклад = ПолучитьОсновнойСклад();
		Если ЗначениеЗаполнено(ОсновнойСклад) Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ОсновнойСклад", ОсновнойСклад);
			ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, ДополнительныеПараметры),
						   "Поле ""Склад"" не заполнено. Заполнить поле значением основного склада?",
						   РежимДиалогаВопрос.ДаНетОтмена);
			Отказ = Истина;						   
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Склад = ДополнительныеПараметры.ОсновнойСклад;	
	КонецЕсли;	
	
	ДополнительныеПараметры.ПараметрыЗаписи.Вставить("НеПроверятьСклад");
	
	Записать(ДополнительныеПараметры.ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновнойСклад()

	Возврат ХранилищеОбщихНастроек.Загрузить("ОсновнойСклад");	

КонецФункции // ПолучитьОсновнойСклад()

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение"));
	ПараметрыЗаписи.Вставить("ЗакрытьФорму");
	
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ЗакрытьФорму") Тогда
		
		Закрыть();		
	
	КонецЕсли;
	
КонецПроцедуры
